In [2]:
import pandas as pd

In [5]:
data =pd.DataFrame({"id":[1,2,3,4],"subject":["maths","science","java","dotnet"]})
data

   id  subject
0   1    maths
1   2  science
2   3     java
3   4   dotnet

In [6]:
data1 = pd.DataFrame({"id":[6,2,3,5],"name":["jobin","ashi","aleena","athira"]})
data1

   id    name
0   6   jobin
1   2    ashi
2   3  aleena
3   5  athira

In [8]:
mer=pd.merge(data,data1, on="id" ,how="inner")
mer

   id  subject    name
0   2  science    ashi
1   3     java  aleena

In [10]:
mer1=pd.merge(data,data1,on="id",how="left")
mer1

   id  subject    name
0   1    maths     NaN
1   2  science    ashi
2   3     java  aleena
3   4   dotnet     NaN

In [11]:
mer2=pd.merge(data,data1,on="id",how="right")
mer2

   id  subject    name
0   6      NaN   jobin
1   2  science    ashi
2   3     java  aleena
3   5      NaN  athira

In [12]:
mer3=pd.merge(data,data1,on="id",how="outer")
mer3

   id  subject    name
0   1    maths     NaN
1   2  science    ashi
2   3     java  aleena
3   4   dotnet     NaN
4   5      NaN  athira
5   6      NaN   jobin